namespace Practice.HardTasks
{
    /// <summary>//TODO: Решить
    /// У Василия есть число a, которое он хочет превратить в число b.
    /// Для этого он может производить два типа операций:
    /// -  умножить имеющееся у него число на 2 (то есть заменить число x числом 2·x);
    /// -  приписать к имеющемуся у него числу цифру 1 справа (то есть заменить число x числом 10·x+1).
    /// -  Вам надо помочь Василию получить из числа a число b с помощью описанных операций, либо сообщить, что это невозможно.
    /// Обратите внимание, что в этой задаче не требуется минимизировать количество операций.
    /// Достаточно найти любой из способов получить из числа a число b.
    /// https://tproger.ru/problems/technocup-problems-2017/ - разбор решения
    /// </summary>
    public class T1
    {
        
    }
}